Output from "make plan", censored some info and replace with "XXXXX".
@NissesSenap 
Terraform will perform the following actions:

  # module.aks1_core.kubernetes_cluster_role.top will be created
  + resource "kubernetes_cluster_role" "top" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "xkf.xenit.io/kind" = "platform"
            }
          + name             = "top"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "rbac.authorization.k8s.io",
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.aks1_core.kubernetes_role_binding.top["apps-svc"] will be created
  + resource "kubernetes_role_binding" "top" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aad-group-name"    = "SG-AAD-AKS-XXXXXXXXXXXXXXXXX"
              + "xkf.xenit.io/kind" = "platform"
            }
          + name             = "apps-svc-top"
          + namespace        = "apps-svc"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "top"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "c551cf11-XXXXXXXXXXXXX"
          + namespace = "default"
        }
    }

  # module.aks1_core.kubernetes_role_binding.top["lab"] will be created
  + resource "kubernetes_role_binding" "top" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aad-group-name"    = "SG-AAD-AKS-XXXXXXXXXXXXXXXXXX"
              + "xkf.xenit.io/kind" = "platform"
            }
          + name             = "lab-top"
          + namespace        = "lab"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "top"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "9881edc1-XXXXXXXXXXXXXXXXX"
          + namespace = "default"
        }
    }

  # module.aks1_core.kubernetes_role_binding.top["monitor"] will be created
  + resource "kubernetes_role_binding" "top" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aad-group-name"    = "SG-AAD-AKS-XXXXXXXXXX
              + "xkf.xenit.io/kind" = "platform"
            }
          + name             = "monitor-top"
          + namespace        = "monitor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "top"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "dcecde4f-XXXXXXXXXXXXX"
          + namespace = "default"
        }
    }

  # module.aks1_core.kubernetes_role_binding.top["xks"] will be created
  + resource "kubernetes_role_binding" "top" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aad-group-name"    = "SG-AAD-AKS-XXXXXXXX"
              + "xkf.xenit.io/kind" = "platform"
            }
          + name             = "xks-top"
          + namespace        = "xks"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "top"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "15c217c1-3XXXXXXXXXXXXX"
          + namespace = "default"
        }
    }